Catalogs/рс_Объекты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>рс_Объекты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Вид</Name>
					<Type>
						<v8:Type>cfg:EnumRef.рс_ВидОбъектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Индентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Раздел</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.рс_Разделы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектБД</Name>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>рс_Реквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>рс_ТабличнаяЧасть</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.рс_ТабличныеЧасти</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.рс_Реквизиты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>рс_Формы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>рс_Форма</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.рс_Формы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяРеквизита</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>256</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Модули</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>рс_Модуль</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.рс_Модули</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Расширения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>256</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Модуль</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.рс_Модули</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Процедура</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>128</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Детализация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.рс_ПрисоединенныеФайлы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/рс_ОбщийМодульСервер/Ext/Module.bsl
Функция ИмяКоллекцииМетаданныхПоВиду(Вид) Экспорт
	
	ИмяВида = Строка(Вид);
	
	Если ИмяВида = "РегистрСведений" Тогда
		Возврат "РегистрыСведений";
	ИначеЕсли ИмяВида = "РегистрНакопления" Тогда
		Возврат "РегистрыНакопления";
	КонецЕсли;
	
	Возврат ИмяВида;
	
КонецФункции

Функция ИмяТипаМетаданныхДляФормы(ИмяКоллекции) Экспорт
	
	Если ИмяКоллекции = "Документы" Тогда
		Возврат "Документ";
	ИначеЕсли ИмяКоллекции = "Справочники" Тогда
		Возврат "Справочник";
	КонецЕсли;
	
	Возврат ИмяКоллекции;
	
КонецФункции

Функция СоздатьОбъектРС(Структура)  Экспорт 
	 
	НовОбъект = Справочники.рс_Объекты.СоздатьЭлемент();	
	НовОбъект.Индентификатор 	= Структура.Индентификатор;
	НовОбъект.Наименование  	= Структура.Наименование; 
	НовОбъект.Вид            	= Структура.Вид;

	НовОбъект.Записать();
	
	ЗаполнитьРеквизитыОбъектаРС(НовОбъект.Ссылка);

	Возврат НовОбъект.Ссылка;
	
КонецФункции

Процедура ЗаполнитьРеквизитыОбъектаРС(Ссылка) Экспорт
		
	СпрОбъект = Ссылка.ПолучитьОбъект(); 	
	СпрОбъект.рс_Реквизиты.Очистить(); 
		
	ИмяКоллекции = ИмяКоллекцииМетаданныхПоВиду(СпрОбъект.Вид);
	
	Структура = Новый Структура; 
	Структура.Вставить("тВид"	, ИмяКоллекции);
	Структура.Вставить("ИД"		, СпрОбъект.Индентификатор);
	Структура.Вставить("Табл"	, СпрОбъект.рс_Реквизиты);
	Структура.Вставить("ТЧ"		, Неопределено);
	
	//ТЧ Реквизиты
	//Реквизиты Объекта
	ЗаполнитьРеквизитыРС(Структура); 
	
	//ТЧ Реквизиты
	//Реквизиты Табличные части Объекта
	Для Каждого Метаданное Из Метаданные[Структура.тВид][Структура.ИД].ТабличныеЧасти Цикл 
		ИмяТЧ 		= Метаданное.Имя;
		ТабЧасть 	=  Справочники.рс_ТабличныеЧасти.НайтиПоНаименованию(ИмяТЧ);
		
		Если Не ЗначениеЗаполнено(ТабЧасть) Тогда 
			ТабЧасть = СоздатьРС_ТабличныеЧасти(ИмяТЧ);
		КонецЕсли;
		
		Структура.Вставить("ТЧ"		, ТабЧасть);
		
		ЗаполнитьРеквизитыРС(Структура);
	КонецЦикла;	
	
	//ТЧ Формы
	СпрОбъект.рс_Формы.Очистить();
	Для Каждого Метаданное Из Метаданные[Структура.тВид][Структура.ИД].Формы Цикл
		НоваяСтрока = СпрОбъект.рс_Формы.Добавить();
		ИмяФормы 	= Метаданное.Имя;
		рсФорма		= Справочники.рс_Формы.НайтиПоНаименованию(ИмяФормы); 
		
		Если Не ЗначениеЗаполнено(рсФорма) Тогда 
			рсФорма = СоздатьРС_Форму(ИмяФормы);
		КонецЕсли;
		
		НоваяСтрока.рс_Форма 	= рсФорма;
	КонецЦикла;
	
	СпрОбъект.Записать();
		
КонецПроцедуры

Функция СоздатьРС_ТабличныеЧасти(ИмяТЧ)
	 СправочникСсылка = Справочники.рс_ТабличныеЧасти.ПустаяСсылка();
	 
	 СправочникОбъект = Справочники.рс_ТабличныеЧасти.СоздатьЭлемент();
	 СправочникОбъект.Наименование = ИмяТЧ;
	 СправочникОбъект.Записать();
	 СправочникСсылка = СправочникОбъект.Ссылка;
	 
	 Возврат СправочникСсылка;
 КонецФункции
 
 Функция СоздатьРС_Форму(ИмяФормы)
	 СправочникСсылка = Справочники.рс_Формы.ПустаяСсылка();
	 
	 СправочникОбъект = Справочники.рс_Формы.СоздатьЭлемент();
	 СправочникОбъект.Наименование = ИмяФормы;
	 СправочникОбъект.Записать();
	 СправочникСсылка = СправочникОбъект.Ссылка;
	 
	 Возврат СправочникСсылка;
 КонецФункции

Процедура ЗаполнитьРеквизитыРС(Структура) Экспорт
	
	МетаданныеОбъекта = Метаданные[Структура.тВид][Структура.ИД];
	
	Если Структура.ТЧ = Неопределено Тогда
		КоллекцияРеквизитов = МетаданныеОбъекта.Реквизиты;
		ТабличнаяЧастьСсылка = Неопределено;
	Иначе
		ИмяТЧ = Структура.ТЧ.Наименование;
		МетаданныеТЧ = МетаданныеОбъекта.ТабличныеЧасти.Найти(ИмяТЧ);
		Если МетаданныеТЧ = Неопределено Тогда
			Возврат;
		КонецЕсли;
		КоллекцияРеквизитов = МетаданныеТЧ.Реквизиты;
		ТабличнаяЧастьСсылка = Структура.ТЧ;
	КонецЕсли;
	
	Для Каждого Метаданное Из КоллекцияРеквизитов Цикл
		НовСтрока = Структура.Табл.Добавить();
		СтрокаТипа = СтрокаТипаИзОписанияТипа(Метаданное.Тип);
		НовСтрока.Имя = ПолучитьСсылкуРеквизита(Метаданное.Имя, Метаданное.Синоним, СтрокаТипа);
		
		Если ТабличнаяЧастьСсылка <> Неопределено Тогда
			НовСтрока.рс_ТабличнаяЧасть = ТабличнаяЧастьСсылка;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

Функция СтрокаТипаИзОписанияТипа(ОписаниеТипа) Экспорт
	
	ТипыРеквизита = ОписаниеТипа.Типы();
	СтрокаТипа = "";
	
	Для Каждого ТипРеквизита Из ТипыРеквизита Цикл
		МетаданныеТипа = Метаданные.НайтиПоТипу(ТипРеквизита);
		Если МетаданныеТипа = Неопределено Тогда
			Возврат Строка(ОписаниеТипа);
		Иначе
			СтрокаТипа = СтрокаТипа + ?(СтрокаТипа = "", "", "; ") + МетаданныеТипа.ПолноеИмя();
		КонецЕсли;
	КонецЦикла;
	
	Возврат СтрокаТипа;
	
КонецФункции

Функция ПолучитьСсылкуТипа(СтрокаТипа) Экспорт
	
	Если Не ЗначениеЗаполнено(СтрокаТипа) Тогда
		Возврат Справочники.рс_ТипыОбъектов.ПустаяСсылка();
	КонецЕсли;
	
	НаименованиеТипа = Лев(СокрЛП(СтрокаТипа), 200);
	СсылкаТипа = Справочники.рс_ТипыОбъектов.НайтиПоНаименованию(НаименованиеТипа, Истина);
	Если ЗначениеЗаполнено(СсылкаТипа) Тогда
		Возврат СсылкаТипа;
	КонецЕсли;
	
	НовыйЭлемент = Справочники.рс_ТипыОбъектов.СоздатьЭлемент();
	НовыйЭлемент.Наименование = НаименованиеТипа;
	НовыйЭлемент.Записать();
	
	Возврат НовыйЭлемент.Ссылка;
	
КонецФункции

Функция ПолучитьСсылкуРеквизита(ИмяРеквизита, СинонимРеквизита, СтрокаТипа) Экспорт
	
	Если Не ЗначениеЗаполнено(ИмяРеквизита) Тогда
		Возврат Справочники.рс_Реквизиты.ПустаяСсылка();
	КонецЕсли;
	
	НаименованиеРеквизита = Лев(СокрЛП(ИмяРеквизита), 250);
	СсылкаРеквизита = Справочники.рс_Реквизиты.НайтиПоНаименованию(НаименованиеРеквизита, Истина);
	Если ЗначениеЗаполнено(СсылкаРеквизита) Тогда
		Возврат СсылкаРеквизита;
	КонецЕсли;
	
	НовыйЭлемент = Справочники.рс_Реквизиты.СоздатьЭлемент();
	НовыйЭлемент.Наименование = НаименованиеРеквизита;
	НовыйЭлемент.Синоним = Лев(СокрЛП(СинонимРеквизита), 256);
	НовыйЭлемент.Тип = ПолучитьСсылкуТипа(СтрокаТипа);
	НовыйЭлемент.Записать();
	
	Возврат НовыйЭлемент.Ссылка;
	
КонецФункции

Функция НайтиОбъектРС(Вид, Имя) Экспорт
	
	ПоискОбъект = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	рс_Объекты.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.рс_Объекты КАК рс_Объекты
		|ГДЕ
		|	рс_Объекты.Вид = &Вид
		|	И рс_Объекты.Индентификатор = &Имя
		|	И рс_Объекты.ПометкаУдаления = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("Вид"	, Вид);
	Запрос.УстановитьПараметр("Имя"	, Имя);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ПоискОбъект = ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
	Возврат ПоискОбъект;
	
КонецФункции	

// Заполняет табличную часть объекта (или коллекцию строк с методами Очистить/Добавить) из значения параметра:
// ТаблицаЗначений; Массив / ФиксированныйМассив (элементы — Структура или строка с совпадающими именами колонок);
// либо коллекция с методом Выгрузить() (табличная часть, ДанныеФормыКоллекция и т.п.).
//
Процедура ЗаполнитьТабличнуюЧастьИзПараметра(ТабличнаяЧастьПриемник, Знач ИсточникДанных, ОчиститьПередЗаполнением = Истина) Экспорт
	
	Если ТабличнаяЧастьПриемник = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ОчиститьПередЗаполнением Тогда
		ТабличнаяЧастьПриемник.Очистить();
	КонецЕсли;
	
	Если ИсточникДанных = Неопределено Или ИсточникДанных = Null Тогда
		Возврат;
	КонецЕсли;
	
	ТипИсточника = ТипЗнч(ИсточникДанных);
	
	Если ТипИсточника = Тип("ТаблицаЗначений") Тогда
		Для Каждого СтрокаДанных Из ИсточникДанных Цикл
			НоваяСтрока = ТабличнаяЧастьПриемник.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаДанных);
		КонецЦикла;
		Возврат;
	КонецЕсли;
	
	Если ТипИсточника = Тип("Массив") Или ТипИсточника = Тип("ФиксированныйМассив") Тогда
		Для Каждого Элемент Из ИсточникДанных Цикл
			НоваяСтрока = ТабличнаяЧастьПриемник.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Элемент);
		КонецЦикла;
		Возврат;
	КонецЕсли;
	
	Для Каждого СтрокаДанных Из ИсточникДанных Цикл
		НоваяСтрока = ТабличнаяЧастьПриемник.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ИсточникДанных);
	КонецЦикла;
	
КонецПроцедуры
